#### SetSegments Method

---

|  |
| --- |
| LinePattern Class   See Also |

Sets the sequence of segments that defines this line pattern.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetSegments( 	IList<LinePatternSegment> lineSegs ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSegments ( _ 	lineSegs As IList(Of LinePatternSegment) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSegments( 	IList<LinePatternSegment^>^ lineSegs ) ``` |

#### Parameters

lineSegs
:   Type:  System.Collections.Generic IList   LinePatternSegment
     The sequence of segments.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

LinePattern Class

Autodesk.Revit.DB Namespace